SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_frc.h
#define _FRC_SEQIEN_RXWORD_SHIFT                           29                                                /**< Shift value for FRC_RXWORD                  */
#define _FRC_SEQIEN_RXWORD_MASK                            0x20000000UL                                      /**< Bit mask for FRC_RXWORD                     */
#define _FRC_SEQIEN_RXWORD_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for FRC_SEQIEN                 */
#define FRC_SEQIEN_RXWORD_DEFAULT                          (_FRC_SEQIEN_RXWORD_DEFAULT << 29)                /**< Shifted mode DEFAULT for FRC_SEQIEN         */
#define FRC_SEQIEN_TXWORD                                  (0x1UL << 30)                                     /**< Transmit Word Interrupt Enable              */
#define _FRC_SEQIEN_TXWORD_SHIFT                           30                                                /**< Shift value for FRC_TXWORD                  */
#define _FRC_SEQIEN_TXWORD_MASK                            0x40000000UL                                      /**< Bit mask for FRC_TXWORD                     */
#define _FRC_SEQIEN_TXWORD_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for FRC_SEQIEN                 */
#define FRC_SEQIEN_TXWORD_DEFAULT                          (_FRC_SEQIEN_TXWORD_DEFAULT << 30)                /**< Shifted mode DEFAULT for FRC_SEQIEN         */
#define FRC_SEQIEN_UARTERROR                               (0x1UL << 31)                                     /**< UART Error Interrupt Enable                 */
#define _FRC_SEQIEN_UARTERROR_SHIFT                        31                                                /**< Shift value for FRC_UARTERROR               */
#define _FRC_SEQIEN_UARTERROR_MASK                         0x80000000UL                                      /**< Bit mask for FRC_UARTERROR                  */
#define _FRC_SEQIEN_UARTERROR_DEFAULT                      0x00000000UL                                      /**< Mode DEFAULT for FRC_SEQIEN                 */
#define FRC_SEQIEN_UARTERROR_DEFAULT                       (_FRC_SEQIEN_UARTERROR_DEFAULT << 31)             /**< Shifted mode DEFAULT for FRC_SEQIEN         */

/* Bit fields for FRC WCNTCMP3 */
#define _FRC_WCNTCMP3_RESETVALUE                           0x00000000UL                                 /**< Default value for FRC_WCNTCMP3              */
#define _FRC_WCNTCMP3_MASK                                 0x00000FFFUL                                 /**< Mask for FRC_WCNTCMP3                       */
#define _FRC_WCNTCMP3_SUPPLENFIELDLOC_SHIFT                0                                            /**< Shift value for FRC_SUPPLENFIELDLOC         */
#define _FRC_WCNTCMP3_SUPPLENFIELDLOC_MASK                 0xFFFUL                                      /**< Bit mask for FRC_SUPPLENFIELDLOC            */
#define _FRC_WCNTCMP3_SUPPLENFIELDLOC_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for FRC_WCNTCMP3               */
#define FRC_WCNTCMP3_SUPPLENFIELDLOC_DEFAULT               (_FRC_WCNTCMP3_SUPPLENFIELDLOC_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_WCNTCMP3       */

/* Bit fields for FRC BOICTRL */
#define _FRC_BOICTRL_RESETVALUE                            0x00000000UL                             /**< Default value for FRC_BOICTRL               */
#define _FRC_BOICTRL_MASK                                  0x0001FFFFUL                             /**< Mask for FRC_BOICTRL                        */
#define FRC_BOICTRL_BOIEN                                  (0x1UL << 0)                             /**< BOI EN                                      */
#define _FRC_BOICTRL_BOIEN_SHIFT                           0                                        /**< Shift value for FRC_BOIEN                   */
#define _FRC_BOICTRL_BOIEN_MASK                            0x1UL                                    /**< Bit mask for FRC_BOIEN                      */
#define _FRC_BOICTRL_BOIEN_DEFAULT                         0x00000000UL                             /**< Mode DEFAULT for FRC_BOICTRL                */
#define FRC_BOICTRL_BOIEN_DEFAULT                          (_FRC_BOICTRL_BOIEN_DEFAULT << 0)        /**< Shifted mode DEFAULT for FRC_BOICTRL        */
#define _FRC_BOICTRL_BOIFIELDLOC_SHIFT                     1                                        /**< Shift value for FRC_BOIFIELDLOC             */
#define _FRC_BOICTRL_BOIFIELDLOC_MASK                      0x1FFEUL                                 /**< Bit mask for FRC_BOIFIELDLOC                */
#define _FRC_BOICTRL_BOIFIELDLOC_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for FRC_BOICTRL                */
#define FRC_BOICTRL_BOIFIELDLOC_DEFAULT                    (_FRC_BOICTRL_BOIFIELDLOC_DEFAULT << 1)  /**< Shifted mode DEFAULT for FRC_BOICTRL        */
#define _FRC_BOICTRL_BOIBITPOS_SHIFT                       13                                       /**< Shift value for FRC_BOIBITPOS               */
#define _FRC_BOICTRL_BOIBITPOS_MASK                        0xE000UL                                 /**< Bit mask for FRC_BOIBITPOS                  */
#define _FRC_BOICTRL_BOIBITPOS_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for FRC_BOICTRL                */
#define FRC_BOICTRL_BOIBITPOS_DEFAULT                      (_FRC_BOICTRL_BOIBITPOS_DEFAULT << 13)   /**< Shifted mode DEFAULT for FRC_BOICTRL        */
#define FRC_BOICTRL_BOIMATCHVAL                            (0x1UL << 16)                            /**< BOI match value                             */
#define _FRC_BOICTRL_BOIMATCHVAL_SHIFT                     16                                       /**< Shift value for FRC_BOIMATCHVAL             */
#define _FRC_BOICTRL_BOIMATCHVAL_MASK                      0x10000UL                                /**< Bit mask for FRC_BOIMATCHVAL                */
#define _FRC_BOICTRL_BOIMATCHVAL_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for FRC_BOICTRL                */
#define FRC_BOICTRL_BOIMATCHVAL_DEFAULT                    (_FRC_BOICTRL_BOIMATCHVAL_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_BOICTRL        */

/* Bit fields for FRC DSLCTRL */
#define _FRC_DSLCTRL_RESETVALUE                            0x00000000UL                                        /**< Default value for FRC_DSLCTRL               */
#define _FRC_DSLCTRL_MASK                                  0x7FFFFF7FUL                                        /**< Mask for FRC_DSLCTRL                        */
#define _FRC_DSLCTRL_DSLMODE_SHIFT                         0                                                   /**< Shift value for FRC_DSLMODE                 */
#define _FRC_DSLCTRL_DSLMODE_MASK                          0x7UL                                               /**< Bit mask for FRC_DSLMODE                    */
#define _FRC_DSLCTRL_DSLMODE_DEFAULT                       0x00000000UL                                        /**< Mode DEFAULT for FRC_DSLCTRL                */
#define _FRC_DSLCTRL_DSLMODE_DISABLE                       0x00000000UL                                        /**< Mode DISABLE for FRC_DSLCTRL                */
#define _FRC_DSLCTRL_DSLMODE_SINGLEBYTE                    0x00000001UL                                        /**< Mode SINGLEBYTE for FRC_DSLCTRL             */
#define _FRC_DSLCTRL_DSLMODE_SINGLEBYTEMSB                 0x00000002UL                                        /**< Mode SINGLEBYTEMSB for FRC_DSLCTRL          */
#define _FRC_DSLCTRL_DSLMODE_DUALBYTELSBFIRST              0x00000003UL                                        /**< Mode DUALBYTELSBFIRST for FRC_DSLCTRL       */
#define _FRC_DSLCTRL_DSLMODE_DUALBYTEMSBFIRST              0x00000004UL                                        /**< Mode DUALBYTEMSBFIRST for FRC_DSLCTRL       */
#define _FRC_DSLCTRL_DSLMODE_INFINITE                      0x00000005UL                                        /**< Mode INFINITE for FRC_DSLCTRL               */
#define _FRC_DSLCTRL_DSLMODE_BLOCKERROR                    0x00000006UL                                        /**< Mode BLOCKERROR for FRC_DSLCTRL             */
#define FRC_DSLCTRL_DSLMODE_DEFAULT                        (_FRC_DSLCTRL_DSLMODE_DEFAULT << 0)                 /**< Shifted mode DEFAULT for FRC_DSLCTRL        */
#define FRC_DSLCTRL_DSLMODE_DISABLE                        (_FRC_DSLCTRL_DSLMODE_DISABLE << 0)                 /**< Shifted mode DISABLE for FRC_DSLCTRL        */
#define FRC_DSLCTRL_DSLMODE_SINGLEBYTE                     (_FRC_DSLCTRL_DSLMODE_SINGLEBYTE << 0)              /**< Shifted mode SINGLEBYTE for FRC_DSLCTRL     */
#define FRC_DSLCTRL_DSLMODE_SINGLEBYTEMSB                  (_FRC_DSLCTRL_DSLMODE_SINGLEBYTEMSB << 0)           /**< Shifted mode SINGLEBYTEMSB for FRC_DSLCTRL  */
#define FRC_DSLCTRL_DSLMODE_DUALBYTELSBFIRST               (_FRC_DSLCTRL_DSLMODE_DUALBYTELSBFIRST << 0)        /**< Shifted mode DUALBYTELSBFIRST for FRC_DSLCTRL*/
#define FRC_DSLCTRL_DSLMODE_DUALBYTEMSBFIRST               (_FRC_DSLCTRL_DSLMODE_DUALBYTEMSBFIRST << 0)        /**< Shifted mode DUALBYTEMSBFIRST for FRC_DSLCTRL*/
#define FRC_DSLCTRL_DSLMODE_INFINITE                       (_FRC_DSLCTRL_DSLMODE_INFINITE << 0)                /**< Shifted mode INFINITE for FRC_DSLCTRL       */
#define FRC_DSLCTRL_DSLMODE_BLOCKERROR                     (_FRC_DSLCTRL_DSLMODE_BLOCKERROR << 0)              /**< Shifted mode BLOCKERROR for FRC_DSLCTRL     */
#define FRC_DSLCTRL_DSLBITORDER                            (0x1UL << 3)                                        /**< Dynamic Frame Length Bit order              */
#define _FRC_DSLCTRL_DSLBITORDER_SHIFT                     3                                                   /**< Shift value for FRC_DSLBITORDER             */
#define _FRC_DSLCTRL_DSLBITORDER_MASK                      0x8UL                                               /**< Bit mask for FRC_DSLBITORDER                */
#define _FRC_DSLCTRL_DSLBITORDER_DEFAULT                   0x00000000UL                                        /**< Mode DEFAULT for FRC_DSLCTRL                */
#define _FRC_DSLCTRL_DSLBITORDER_NORMAL                    0x00000000UL                                        /**< Mode NORMAL for FRC_DSLCTRL                 */
#define _FRC_DSLCTRL_DSLBITORDER_REVERSE                   0x00000001UL                                        /**< Mode REVERSE for FRC_DSLCTRL                */
#define FRC_DSLCTRL_DSLBITORDER_DEFAULT                    (_FRC_DSLCTRL_DSLBITORDER_DEFAULT << 3)             /**< Shifted mode DEFAULT for FRC_DSLCTRL        */
#define FRC_DSLCTRL_DSLBITORDER_NORMAL                     (_FRC_DSLCTRL_DSLBITORDER_NORMAL << 3)              /**< Shifted mode NORMAL for FRC_DSLCTRL         */
#define FRC_DSLCTRL_DSLBITORDER_REVERSE                    (_FRC_DSLCTRL_DSLBITORDER_REVERSE << 3)             /**< Shifted mode REVERSE for FRC_DSLCTRL        */
#define _FRC_DSLCTRL_DSLSHIFT_SHIFT                        4                                                   /**< Shift value for FRC_DSLSHIFT                */
#define _FRC_DSLCTRL_DSLSHIFT_MASK                         0x70UL                                              /**< Bit mask for FRC_DSLSHIFT                   */
#define _FRC_DSLCTRL_DSLSHIFT_DEFAULT                      0x00000000UL                                        /**< Mode DEFAULT for FRC_DSLCTRL                */
#define FRC_DSLCTRL_DSLSHIFT_DEFAULT                       (_FRC_DSLCTRL_DSLSHIFT_DEFAULT << 4)                /**< Shifted mode DEFAULT for FRC_DSLCTRL        */
#define _FRC_DSLCTRL_DSLOFFSET_SHIFT                       8                                                   /**< Shift value for FRC_DSLOFFSET               */
#define _FRC_DSLCTRL_DSLOFFSET_MASK                        0xFF00UL                                            /**< Bit mask for FRC_DSLOFFSET                  */
#define _FRC_DSLCTRL_DSLOFFSET_DEFAULT                     0x00000000UL                                        /**< Mode DEFAULT for FRC_DSLCTRL                */
#define FRC_DSLCTRL_DSLOFFSET_DEFAULT                      (_FRC_DSLCTRL_DSLOFFSET_DEFAULT << 8)               /**< Shifted mode DEFAULT for FRC_DSLCTRL        */
#define _FRC_DSLCTRL_DSLBITS_SHIFT                         16                                                  /**< Shift value for FRC_DSLBITS                 */
#define _FRC_DSLCTRL_DSLBITS_MASK                          0xF0000UL                                           /**< Bit mask for FRC_DSLBITS                    */
#define _FRC_DSLCTRL_DSLBITS_DEFAULT                       0x00000000UL                                        /**< Mode DEFAULT for FRC_DSLCTRL                */
#define FRC_DSLCTRL_DSLBITS_DEFAULT                        (_FRC_DSLCTRL_DSLBITS_DEFAULT << 16)                /**< Shifted mode DEFAULT for FRC_DSLCTRL        */
#define _FRC_DSLCTRL_DSLMINLENGTH_SHIFT                    20                                                  /**< Shift value for FRC_DSLMINLENGTH            */
#define _FRC_DSLCTRL_DSLMINLENGTH_MASK                     0xF00000UL                                          /**< Bit mask for FRC_DSLMINLENGTH               */
#define _FRC_DSLCTRL_DSLMINLENGTH_DEFAULT                  0x00000000UL                                        /**< Mode DEFAULT for FRC_DSLCTRL                */
#define FRC_DSLCTRL_DSLMINLENGTH_DEFAULT                   (_FRC_DSLCTRL_DSLMINLENGTH_DEFAULT << 20)           /**< Shifted mode DEFAULT for FRC_DSLCTRL        */
#define _FRC_DSLCTRL_RXSUPRECEPMODE_SHIFT                  24                                                  /**< Shift value for FRC_RXSUPRECEPMODE          */
#define _FRC_DSLCTRL_RXSUPRECEPMODE_MASK                   0x7000000UL                                         /**< Bit mask for FRC_RXSUPRECEPMODE             */
#define _FRC_DSLCTRL_RXSUPRECEPMODE_DEFAULT                0x00000000UL                                        /**< Mode DEFAULT for FRC_DSLCTRL                */
#define _FRC_DSLCTRL_RXSUPRECEPMODE_NOSUP                  0x00000000UL                                        /**< Mode NOSUP for FRC_DSLCTRL                  */
#define _FRC_DSLCTRL_RXSUPRECEPMODE_BOIDSLBASED            0x00000001UL                                        /**< Mode BOIDSLBASED for FRC_DSLCTRL            */
#define _FRC_DSLCTRL_RXSUPRECEPMODE_BOIFIXEDSLBASED        0x00000002UL                                        /**< Mode BOIFIXEDSLBASED for FRC_DSLCTRL        */
#define _FRC_DSLCTRL_RXSUPRECEPMODE_DSLBASED               0x00000003UL                                        /**< Mode DSLBASED for FRC_DSLCTRL               */
#define _FRC_DSLCTRL_RXSUPRECEPMODE_FIXEDSLBASED           0x00000004UL                                        /**< Mode FIXEDSLBASED for FRC_DSLCTRL           */
#define FRC_DSLCTRL_RXSUPRECEPMODE_DEFAULT                 (_FRC_DSLCTRL_RXSUPRECEPMODE_DEFAULT << 24)         /**< Shifted mode DEFAULT for FRC_DSLCTRL        */
#define FRC_DSLCTRL_RXSUPRECEPMODE_NOSUP                   (_FRC_DSLCTRL_RXSUPRECEPMODE_NOSUP << 24)           /**< Shifted mode NOSUP for FRC_DSLCTRL          */
#define FRC_DSLCTRL_RXSUPRECEPMODE_BOIDSLBASED             (_FRC_DSLCTRL_RXSUPRECEPMODE_BOIDSLBASED << 24)     /**< Shifted mode BOIDSLBASED for FRC_DSLCTRL    */
#define FRC_DSLCTRL_RXSUPRECEPMODE_BOIFIXEDSLBASED         (_FRC_DSLCTRL_RXSUPRECEPMODE_BOIFIXEDSLBASED << 24) /**< Shifted mode BOIFIXEDSLBASED for FRC_DSLCTRL*/
#define FRC_DSLCTRL_RXSUPRECEPMODE_DSLBASED                (_FRC_DSLCTRL_RXSUPRECEPMODE_DSLBASED << 24)        /**< Shifted mode DSLBASED for FRC_DSLCTRL       */
#define FRC_DSLCTRL_RXSUPRECEPMODE_FIXEDSLBASED            (_FRC_DSLCTRL_RXSUPRECEPMODE_FIXEDSLBASED << 24)    /**< Shifted mode FIXEDSLBASED for FRC_DSLCTRL   */
#define FRC_DSLCTRL_STORESUP                               (0x1UL << 27)                                       /**< Store SUPP in BUFC                          */
#define _FRC_DSLCTRL_STORESUP_SHIFT                        27                                                  /**< Shift value for FRC_STORESUP                */
#define _FRC_DSLCTRL_STORESUP_MASK                         0x8000000UL                                         /**< Bit mask for FRC_STORESUP                   */
#define _FRC_DSLCTRL_STORESUP_DEFAULT                      0x00000000UL                                        /**< Mode DEFAULT for FRC_DSLCTRL                */
#define FRC_DSLCTRL_STORESUP_DEFAULT                       (_FRC_DSLCTRL_STORESUP_DEFAULT << 27)               /**< Shifted mode DEFAULT for FRC_DSLCTRL        */
#define _FRC_DSLCTRL_SUPSHFFACTOR_SHIFT                    28                                                  /**< Shift value for FRC_SUPSHFFACTOR            */
#define _FRC_DSLCTRL_SUPSHFFACTOR_MASK                     0x70000000UL                                        /**< Bit mask for FRC_SUPSHFFACTOR               */
#define _FRC_DSLCTRL_SUPSHFFACTOR_DEFAULT                  0x00000000UL                                        /**< Mode DEFAULT for FRC_DSLCTRL                */
#define FRC_DSLCTRL_SUPSHFFACTOR_DEFAULT                   (_FRC_DSLCTRL_SUPSHFFACTOR_DEFAULT << 28)           /**< Shifted mode DEFAULT for FRC_DSLCTRL        */

