SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_frc.h
/* Bit fields for FRC WCNTCMP4 */
#define _FRC_WCNTCMP4_RESETVALUE                           0x00000000UL                            /**< Default value for FRC_WCNTCMP4              */
#define _FRC_WCNTCMP4_MASK                                 0x00000FFFUL                            /**< Mask for FRC_WCNTCMP4                       */
#define _FRC_WCNTCMP4_SUPPLENGTH_SHIFT                     0                                       /**< Shift value for FRC_SUPPLENGTH              */
#define _FRC_WCNTCMP4_SUPPLENGTH_MASK                      0xFFFUL                                 /**< Bit mask for FRC_SUPPLENGTH                 */
#define _FRC_WCNTCMP4_SUPPLENGTH_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for FRC_WCNTCMP4               */
#define FRC_WCNTCMP4_SUPPLENGTH_DEFAULT                    (_FRC_WCNTCMP4_SUPPLENGTH_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_WCNTCMP4       */

/* Bit fields for FRC WCNTCMP5 */
#define _FRC_WCNTCMP5_RESETVALUE                           0x00000000UL                            /**< Default value for FRC_WCNTCMP5              */
#define _FRC_WCNTCMP5_MASK                                 0x00000FFFUL                            /**< Mask for FRC_WCNTCMP5                       */
#define _FRC_WCNTCMP5_RXPAUSELOC_SHIFT                     0                                       /**< Shift value for FRC_RXPAUSELOC              */
#define _FRC_WCNTCMP5_RXPAUSELOC_MASK                      0xFFFUL                                 /**< Bit mask for FRC_RXPAUSELOC                 */
#define _FRC_WCNTCMP5_RXPAUSELOC_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for FRC_WCNTCMP5               */
#define FRC_WCNTCMP5_RXPAUSELOC_DEFAULT                    (_FRC_WCNTCMP5_RXPAUSELOC_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_WCNTCMP5       */

/* Bit fields for FRC PKTBUFCTRL */
#define _FRC_PKTBUFCTRL_RESETVALUE                         0x00000000UL                                      /**< Default value for FRC_PKTBUFCTRL            */
#define _FRC_PKTBUFCTRL_MASK                               0x0303FFFFUL                                      /**< Mask for FRC_PKTBUFCTRL                     */
#define _FRC_PKTBUFCTRL_PKTBUFSTARTLOC_SHIFT               0                                                 /**< Shift value for FRC_PKTBUFSTARTLOC          */
#define _FRC_PKTBUFCTRL_PKTBUFSTARTLOC_MASK                0xFFFUL                                           /**< Bit mask for FRC_PKTBUFSTARTLOC             */
#define _FRC_PKTBUFCTRL_PKTBUFSTARTLOC_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for FRC_PKTBUFCTRL             */
#define FRC_PKTBUFCTRL_PKTBUFSTARTLOC_DEFAULT              (_FRC_PKTBUFCTRL_PKTBUFSTARTLOC_DEFAULT << 0)     /**< Shifted mode DEFAULT for FRC_PKTBUFCTRL     */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_SHIFT              12                                                /**< Shift value for FRC_PKTBUFTHRESHOLD         */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_MASK               0x3F000UL                                         /**< Bit mask for FRC_PKTBUFTHRESHOLD            */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for FRC_PKTBUFCTRL             */
#define FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_DEFAULT             (_FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_DEFAULT << 12)   /**< Shifted mode DEFAULT for FRC_PKTBUFCTRL     */
#define FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN                   (0x1UL << 24)                                     /**< Packet Buffer Threshold Enable              */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_SHIFT            24                                                /**< Shift value for FRC_PKTBUFTHRESHOLDEN       */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_MASK             0x1000000UL                                       /**< Bit mask for FRC_PKTBUFTHRESHOLDEN          */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_DEFAULT          0x00000000UL                                      /**< Mode DEFAULT for FRC_PKTBUFCTRL             */
#define FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_DEFAULT           (_FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUFCTRL     */
#define FRC_PKTBUFCTRL_PKTBUFSTOP                          (0x1UL << 25)                                     /**< Packet Buffer stop receiving command        */
#define _FRC_PKTBUFCTRL_PKTBUFSTOP_SHIFT                   25                                                /**< Shift value for FRC_PKTBUFSTOP              */
#define _FRC_PKTBUFCTRL_PKTBUFSTOP_MASK                    0x2000000UL                                       /**< Bit mask for FRC_PKTBUFSTOP                 */
#define _FRC_PKTBUFCTRL_PKTBUFSTOP_DEFAULT                 0x00000000UL                                      /**< Mode DEFAULT for FRC_PKTBUFCTRL             */
#define FRC_PKTBUFCTRL_PKTBUFSTOP_DEFAULT                  (_FRC_PKTBUFCTRL_PKTBUFSTOP_DEFAULT << 25)        /**< Shifted mode DEFAULT for FRC_PKTBUFCTRL     */

/* Bit fields for FRC PKTBUFSTATUS */
#define _FRC_PKTBUFSTATUS_RESETVALUE                       0x00000000UL                                 /**< Default value for FRC_PKTBUFSTATUS          */
#define _FRC_PKTBUFSTATUS_MASK                             0x0000003FUL                                 /**< Mask for FRC_PKTBUFSTATUS                   */
#define _FRC_PKTBUFSTATUS_PKTBUFCOUNT_SHIFT                0                                            /**< Shift value for FRC_PKTBUFCOUNT             */
#define _FRC_PKTBUFSTATUS_PKTBUFCOUNT_MASK                 0x3FUL                                       /**< Bit mask for FRC_PKTBUFCOUNT                */
#define _FRC_PKTBUFSTATUS_PKTBUFCOUNT_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for FRC_PKTBUFSTATUS           */
#define FRC_PKTBUFSTATUS_PKTBUFCOUNT_DEFAULT               (_FRC_PKTBUFSTATUS_PKTBUFCOUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_PKTBUFSTATUS   */

